Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 棘子成曰：「君子質而已矣，何以文爲？」子貢曰：「惜乎，夫子之說，君子也，駟不及舌！文猶質也，質猶文也；虎豹之鞹，猶犬羊之鞹。」
en: Chi Tsze-ch'ang said, "In a superior man it is only the substantial qualities which are wanted;—why should we seek for ornamental accomplishments?" Tsze-kung said, "Alas! Your words, sir, show you to be a superior man, but four horses cannot overtake the tongue. Ornament is as substance; substance is as ornament. The hide of a tiger or a leopard stripped of its hair, is like the hide of a dog or a goat stripped of its hair."

source: 哀公問於有若曰：「年饑，用不足，如之何？」有若對曰：「盍徹乎？」曰：「二，吾猶不足，如之何其徹也？」對曰：「百姓足，君孰與不足？百姓不足，君孰與足！」
en: The Duke Ai inquired of Yu Zo, saying, "The year is one of scarcity, and the returns for expenditure are not sufficient;—what is to be done?" Yu Zo replied to him, "Why not simply tithe the people?" "With two tenths, said the duke, "I find it not enough;—how could I do with that system of one tenth?" Yu Zo answered, "If the people have plenty, their prince will not be left to want alone. If the people are in want, their prince cannot enjoy plenty alone."

source: 子張問「崇德，辨惑。」子曰：「主忠信，徙義：崇德也。愛之欲其生，惡之欲其死；既欲其生，又欲其死：是惑也。」（誠不以富，亦祇以異。）
en: Tsze-chang having asked how virtue was to be exalted, and delusions to be discovered, the Master said, "Hold faithfulness and sincerity as first principles, and be moving continually to what is right;—this is the way to exalt one's virtue. "You love a man and wish him to live; you hate him and wish him to die. Having wished him to live, you also wish him to die. This is a case of delusion. "'It may not be on account of her being rich, yet you come to make a difference.'"

source: 齊景公問「政」於孔子。孔子對曰：「君君，臣臣，父父，子子。」公曰：「善哉！信如君不君，臣不臣，父不父，子不子，雖有粟，吾得而食諸？」
en: The Duke Ching, of Ch'i, asked Confucius about government. Confucius replied, "There is government, when the prince is prince, and the minister is minister; when the father is father, and the son is son." "Good!" said the duke; "if, indeed; the prince be not prince, the minister not minister, the father not father, and the son not son, although I have my revenue, can I enjoy it?"

source: 子曰：「片言可以折獄者，其由也與！」子路無宿諾。
en: The Master said, "Ah! it is Yu, who could with half a word settle litigations!" Tsze-lu never slept over a promise.

source: 子曰：「聽訟，吾猶人也；必也使無訟乎！」
en: The Master said, "In hearing litigations, I am like any other body. What is necessary, however, is to cause the people to have no litigations."

source: 子張問「政」。子曰：「居之無倦，行之以忠。」
en: Tsze-chang asked about government. The Master said, "The art of governing is to keep its affairs before the mind without weariness, and to practise them with undeviating consistency."

source: 子曰：「博學以文，約之以禮；亦可以弗畔矣夫！」
en: The Master said, "By extensively studying all learning, and keeping himself under the restraint of the rules of propriety, one may thus likewise not err from what is right."

source: 子曰：「君子成人之美，不成人之惡。小人反是。」
en: The Master said, "The superior man seeks to perfect the admirable qualities of men, and does not seek to perfect their bad qualities. The mean man does the opposite of this."

source: 季康子問「政」於孔子。孔子對曰：「『政』者，正也。子帥以正，孰敢不正？」
en: Chi K'ang asked Confucius about government. Confucius replied, "To govern means to rectify. If you lead on the people with correctness, who will dare not to be correct?"

source: 季康子患盜，問於孔子。孔子對曰：「苟子之不欲，雖賞之不竊。」
en: Chi K'ang, distressed about the number of thieves in the state, inquired of Confucius how to do away with them. Confucius said, "If you, sir, were not covetous, although you should reward them to do it, they would not steal."

source: 季康子問政於孔子曰：「如殺無道，以就有道，何如？」孔子對曰：「子爲政，焉用殺？子欲善，而民善矣。君子之德，風；小人之德，草；草上之風，必偃。」
en: Chi K'ang asked Confucius about government, saying, "What do you say to killing the unprincipled for the good of the principled?" Confucius replied, "Sir, in carrying on your government, why should you use killing at all? Let your evinced desires be for what is good, and the people will be good. The relation between superiors and inferiors, is like that between the wind and the grass. The grass must bend, when the wind blows across it."

source: 子張問：「士何如斯可謂之『達』矣？」子曰：「何哉，爾所謂『達』者？」子張對曰：「在邦必聞，在家必聞。」子曰：「是『聞』也，非『達』也。夫『達』也者，質直而好義，察言而觀色，慮以下人，在邦必達，在家必達。夫『聞』也者：色取仁而行違，居之不疑。在邦必聞，在家必聞。」
en: Tsze-chang asked, "What must the officer be, who may be said to be distinguished?" The Master said, "What is it you call being distinguished?" Tsze-chang replied, "It is to be heard of through the State, to be heard of throughout his clan." The Master said, "That is notoriety, not distinction. "Now the man of distinction is solid and straightforward, and loves righteousness. He examines people's words, and looks at their countenances. He is anxious to humble himself to others. Such a man will be distinguished in the country; he will be distinguished in his clan. "As to the man of notoriety, he assumes the appearance of virtue, but his actions are opposed to it, and he rests in this character without any doubts about himself. Such a man will be heard of in the country; he will be heard of in the clan."

source: 樊遲從遊於舞雩之下曰：「敢問崇德，脩慝，辨惑？」子曰：「善哉問！先事後得，非『崇德』與？攻其惡，無攻人之惡，非『脩慝』與？一朝之忿，忘其身以及其親，非『惑』與？」
en: Fan Ch'ih rambling with the Master under the trees about the rain altars, said, "I venture to ask how to exalt virtue, to correct cherished evil, and to discover delusions." The Master said, "Truly a good question! "If doing what is to be done be made the first business, and success a secondary consideration;—is not this the way to exalt virtue? To assail one's own wickedness and not assail that of others;—is not this the way to correct cherished evil? For a morning's anger to disregard one's own life, and involve that of his parents;—is not this a case of delusion?"

source: 樊遲問「仁」。子曰：「愛人。」問「知」。子曰：「知人。」樊遲未達，子曰：「擧直錯諸枉，能使枉者直。」樊遲退，見子夏曰：「鄉也吾見於夫子而問『知』，子曰：『擧直錯諸枉，能使枉者直』，何謂也？」子夏曰：「富哉言乎！舜有天下，選於眾，擧皋陶，不仁者遠矣。湯有天下，選於眾，擧伊尹，不仁者遠矣。」
en: Fan Ch'ih asked about benevolence. The Master said, "It is to love all men." He asked about knowledge. The Master said, "It is to know all men." Fan Ch'ih did not immediately understand these answers. The Master said, "Employ the upright and put aside all the crooked;—in this way the crooked can be made to be upright." Fan Ch'ih retired, and, seeing Tsze-hsia, he said to him, "A Little while ago, I had an interview with our Master, and asked him about knowledge. He said, "Employ the upright, and put aside all the crooked;—in this way, the crooked will be made to be upright." What did he mean?" Tsze-hsia said, "Truly rich is his saying! "Shun, being in possession of the kingdom, selected from among all the people, and employed Kao-yao, on which all who were devoid of virtue disappeared. T'ang, being in possession of the kingdom, selected from among all the people, and employed I Yin, and all who were devoid of virtue disappeared."

source: 子貢問「友」。子曰：「忠吿而善道之，不可則止，毋自辱焉。」
en: Tsze-kung asked about friendship. The Master said, "Faithfully admonish your friend, and skillfully lead him on. If you find him impracticable, stop. Do not disgrace yourself."

source: 曾子曰：「君子以文會友，以友輔仁。」
en: The philosopher Tsang said, "The superior man on grounds of culture meets with his friends, and by their friendship helps his virtue."

source: 子路問政。子曰：「先之，勞之。」請益，曰：「無倦。」
en: Tsze-lu asked about government. The Master said, "Go before the people with your example, and be laborious in their affairs." He requested further instruction, and was answered, "Be not weary (in these things)."

source: 仲弓爲季氏宰，問政。子曰：「先有司。赦小過。擧賢才。」曰：「焉知賢才而擧之？」曰：「擧爾所知。爾所不知，人其舍諸？」
en: Chung-kung, being chief minister to the Head of the Chi family, asked about government. The Master said, "Employ first the services of your various officers, pardon small faults, and raise to office men of virtue and talents." Chung-kung said, "How shall I know the men of virtue and talent, so that I may raise them to office?" He was answered, "Raise to office those whom you know. As to those whom you do not know, will others neglect them?"

source: 子路曰：「衞君待子而爲政，子將奚先？」子曰：「必也正名乎！」子路曰：「有是哉？子之迂也！奚其正？」子曰：「野哉，由也！君子於其所不知，蓋闕如也。名不正，則言不順；言不順，則事不成；事不成，則禮樂不興；禮樂不興，則刑罰不中；刑罰不中，則民無所措手足。故君子名之必可言也，言之必可行也。君子於其言，無所苟而已矣。」
en: Tsze-lu said, "The ruler of Wei has been waiting for you, in order with you to administer the government. What will you consider the first thing to be done?" The Master replied, "What is necessary is to rectify names." "So, indeed!" said Tsze-lu. "You are wide of the mark! Why must there be such rectification?" The Master said, "How uncultivated you are, Yu! A superior man, in regard to what he does not know, shows a cautious reserve. "If names be not correct, language is not in accordance with the truth of things. If language be not in accordance with the truth of things, affairs cannot be carried on to success. "When affairs cannot be carried on to success, proprieties and music will not flourish. When proprieties and music do not flourish, punishments will not be properly awarded. When punishments are not properly awarded, the people do not know how to move hand or foot. "Therefore a superior man considers it necessary that the names he uses may be spoken appropriately, and also that what he speaks may be carried out appropriately. What the superior man requires, is just that in his words there may be nothing incorrect."

source: 樊遲請學稼，子曰：「吾不如老農。」請學爲圃，曰：「吾不如老圃。」樊遲出，子曰：「小人哉，樊須也！上好禮，則民莫敢不敬；上好義，則民莫敢不服；上好信，則民莫敢不用情，夫如是，則四方之民，襁負其子而至矣，焉用稼？」
en: Fan Ch'ih requested to be taught husbandry. The Master said, "I am not so good for that as an old husbandman." He requested also to be taught gardening, and was answered, "I am not so good for that as an old gardener." Fan Ch'ih having gone out, the Master said, "A small man, indeed, is Fan Hsu! If a superior love propriety, the people will not dare not to be reverent. If he love righteousness, the people will not dare not to submit to his example. If he love good faith, the people will not dare not to be sincere. Now, when these things obtain, the people from all quarters will come to him, bearing their children on their backs;—what need has he of a knowledge of husbandry?"

source: 子曰：「誦詩三百，授之以政，不達。使於四方，不能專對；雖多，亦奚以爲？」
en: The Master said, "Though a man may be able to recite the three hundred odes, yet if, when intrusted with a governmental charge, he knows not how to act, or if, when sent to any quarter on a mission, he cannot give his replies unassisted, notwithstanding the extent of his learning, of what practical use is it?"

source: 子曰：「其身正，不令而行；其身不正，雖令不從。」
en: The Master said, "When a prince's personal conduct is correct, his government is effective without the issuing of orders. If his personal conduct is not correct, he may issue orders, but they will not be followed."

source: 子曰：「魯衞之政，兄弟也。」
en: The Master said, "The governments of Lu and Wei are brothers."

source: 子謂衞公子荊，「善居室：始有，曰：『苟合矣；』少有，曰：『苟完矣。』富有，曰：『苟美矣。』」
en: The Master said of Ching, a scion of the ducal family of Wei, that he knew the economy of a family well. When he began to have means, he said, "Ha! here is a collection!" When they were a little increased, he said, "Ha! this is complete!" When he had become rich, he said, "Ha! this is admirable!"

source: 子適衞，冉有僕。子曰：「庶矣哉！」冉有曰：「既庶矣，又何加焉？」曰：「富之。」曰：「既富矣，又何加焉？」曰：「教之。」
en: When the Master went to Wei, Zan Yu acted as driver of his carriage. The Master observed, "How numerous are the people!" Yu said, "Since they are thus numerous, what more shall be done for them?" "Enrich them," was the reply. "And when they have been enriched, what more shall be done?" The Master said, "Teach them."

source: 子曰：「苟有用我者，期月而已可也，三年有成。」
en: The Master said, "If there were (any of the princes) who would employ me, in the course of twelve months, I should have done something considerable. In three years, the government would be perfected."

source: 子曰：「『善人爲邦百年，亦可以勝殘去殺矣。』誠哉是言也。」
en: The Master said, "'If good men were to govern a country in succession for a hundred years, they would be able to transform the violently bad, and dispense with capital punishments.' True indeed is this saying!"

source: 子曰：「如有王者，必世而後仁。」
en: The Master said, "If a truly royal ruler were to arise, it would still require a generation, and then virtue would prevail."

source: 子曰：「苟正其身矣，於從政乎何有？不能正其身，如正人何？」
en: The Master said, "If a minister make his own conduct correct, what difficulty will he have in assisting in government? If he cannot rectify himself, what has he to do with rectifying others?"

source: 冉子退朝，子曰：「何晏也？」對曰：「有政。」子曰：「其事也！如有政，雖不吾以，吾其與聞之！」
en: The disciple Zan returning from the court, the Master said to him, "How are you so late?" He replied, "We had government business." The Master said, "It must have been family affairs. If there had been government business, though I am not now in office, I should have been consulted about it."

source: 定公問：「一言而可以興邦，有諸？」孔子對曰：「言不可以若是其幾也！人之言曰：『爲君難，爲臣不易』。如知爲君之難也，不幾乎一言而興邦乎？」曰：「一言而喪邦，有諸？」孔子對曰：「言不可以若是其幾也！人之言曰：『予無樂乎爲君，唯其言而莫予違也。』如其善而莫之違也，不亦善乎？如不善而莫之違也，不幾乎一言而喪邦乎？」
en: The Duke Ting asked whether there was a single sentence which could make a country prosperous. Confucius replied, "Such an effect cannot be expected from one sentence. "There is a saying, however, which people have—'To be a prince is difficult; to be a minister is not easy.' "If a ruler knows this,—the difficulty of being a prince,—may there not be expected from this one sentence the prosperity of his country?" The duke then said, "Is there a single sentence which can ruin a country?" Confucius replied, "Such an effect as that cannot be expected from one sentence. There is, however, the saying which people have—'I have no pleasure in being a prince, but only in that no one can offer any opposition to what I say!' "If a ruler's words be good, is it not also good that no one oppose them? But if they are not good, and no one opposes them, may there not be expected from this one sentence the ruin of his country?"

source: 葉公問政。子曰：「近者說，遠者來。」
en: The Duke of Sheh asked about government. The Master said, "Good government obtains, when those who are near are made happy, and those who are far off are attracted."

source: 子夏爲莒父宰，問政。子曰：「無欲速，無見小利。欲速，則不達；見小利，則大事不成。」
en: Tsze-hsia, being governor of Chu-fu, asked about government. The Master said, "Do not be desirous to have things done quickly; do not look at small advantages. Desire to have things done quickly prevents their being done thoroughly. Looking at small advantages prevents great affairs from being accomplished."

source: 葉公語孔子曰：「吾黨有直躬者，其父攘羊，而子證之。」孔子曰：「吾黨之直者異於是，父爲子隱，子爲父隱，直在其中矣。」
en: The Duke of Sheh informed Confucius, saying, "Among us here there are those who may be styled upright in their conduct. If their father have stolen a sheep, they will bear witness to the fact." Confucius said, "Among us, in our part of the country, those who are upright are different from this. The father conceals the misconduct of the son, and the son conceals the misconduct of the father. Uprightness is to be found in this."

source: 樊遲問仁。子曰：「居處恭，執事敬，與人忠。雖之夷狄，不可棄也。」
en: Fan Ch'ih asked about perfect virtue. The Master said, "It is, in retirement, to be sedately grave; in the management of business, to be reverently attentive; in intercourse with others, to be strictly sincere. Though a man go among rude, uncultivated tribes, these qualities may not be neglected."

source: 子貢問曰：「何如斯可謂之『士』矣？」子曰：「行己有恥，使於四方，不辱君命；可謂『士』矣。」曰：「敢問其次。」曰：「宗族稱孝焉，鄉黨稱弟焉。」曰：「敢問其次。」曰：「言必信，行必果，硜硜然，小人哉，抑亦可以爲次矣。」曰：「今之從政者何如？」子曰：「噫！斗筲之人，何足算也！」
en: Tsze-kung asked, saying, "What qualities must a man possess to entitle him to be called an officer? The Master said, "He who in his conduct of himself maintains a sense of shame, and when sent to any quarter will not disgrace his prince's commission, deserves to be called an officer." Tsze-kung pursued, "I venture to ask who may be placed in the next lower rank?" And he was told, "He whom the circle of his relatives pronounce to be filial, whom his fellow-villagers and neighbours pronounce to be fraternal." Again the disciple asked, "I venture to ask about the class still next in order." The Master said, "They are determined to be sincere in what they say, and to carry out what they do. They are obstinate little men. Yet perhaps they may make the next class." Tsze-kung finally inquired, "Of what sort are those of the present day, who engage in government?" The Master said "Pooh! they are so many pecks and hampers, not worth being taken into account."

source: 子曰：「不得中行而與之，必也狂狷乎：狂者進取，狷者有所不爲也。」
en: The Master said, "Since I cannot get men pursuing the due medium, to whom I might communicate my instructions, I must find the ardent and the cautiously-decided. The ardent will advance and lay hold of truth; the cautiously-decided will keep themselves from what is wrong."

source: 子曰：「南人有言曰：『人而無恆，不可以作巫醫』。「善夫！『不恆其德，或承之羞』」子曰：「不占而已矣。」
en: The Master said, "The people of the south have a saying—'A man without constancy cannot be either a wizard or a doctor.' Good! "Inconstant in his virtue, he will be visited with disgrace." The Master said, "This arises simply from not attending to the prognostication."

source: 子曰：「君子和而不同，小人同而不和。」
en: The Master said, "The superior man is affable, but not adulatory; the mean man is adulatory, but not affable."

source: 子貢問曰：「鄉人皆好之，何如？」子曰：「未可也。」「鄉人皆惡之，何如？」子曰：「未可也。不如鄉人之善者好之，其不善者惡之。」
en: Tsze-kung asked, saying, "What do you say of a man who is loved by all the people of his neighborhood?" The Master replied, "We may not for that accord our approval of him." "And what do you say of him who is hated by all the people of his neighborhood?" The Master said, "We may not for that conclude that he is bad. It is better than either of these cases that the good in the neighborhood love him, and the bad hate him."

source: 子曰：「君子易事而難說也；說之不以道，不說也；及其使人也，器之。小人難事而易說也。說之雖不以道，說也；及其使人也，求備焉。」
en: The Master said, "The superior man is easy to serve and difficult to please. If you try to please him in any way which is not accordant with right, he will not be pleased. But in his employment of men, he uses them according to their capacity. The mean man is difficult to serve, and easy to please. If you try to please him, though it be in a way which is not accordant with right, he may be pleased. But in his employment of men, he wishes them to be equal to everything."

source: 子曰：「君子泰而不驕；小人驕而不泰。」
en: The Master said, "The superior man has a dignified ease without pride. The mean man has pride without a dignified ease."

source: 子曰：「剛毅木訥，近仁。」
en: The Master said, "The firm, the enduring, the simple, and the modest are near to virtue."

source: 子路問曰：「何如斯可謂之『士』矣？」子曰：「切切偲偲、怡怡如也，可謂『士』矣。朋友切切偲偲，兄弟怡怡。」
en: Tsze-lu asked, saying, "What qualities must a man possess to entitle him to be called a scholar?" The Master said, "He must be thus,—earnest, urgent, and bland:—among his friends, earnest and urgent; among his brethren, bland."

source: 子曰：「善人教民七年，亦可以卽戎矣。」
en: The Master said, "Let a good man teach the people seven years, and they may then likewise be employed in war."

source: 子曰：「以不教民戰，是謂棄之。」
en: The Master said, "To lead an uninstructed people to war, is to throw them away."

source: 憲問「恥」。子曰：「邦有道，穀；邦無道，穀，恥也。」
en: Hsien asked what was shameful. The Master said, "When good government prevails in a state, to be thinking only of salary; and, when bad government prevails, to be thinking, in the same way, only of salary;—this is shameful."

source: 「克、伐、怨、欲，不行焉，可以爲仁矣？」子曰：「可以爲難矣，仁則吾不知也。」
en: "When the love of superiority, boasting, resentments, and covetousness are repressed, this may be deemed perfect virtue." The Master said, "This may be regarded as the achievement of what is difficult. But I do not know that it is to be deemed perfect virtue."

source: 子曰：「士而懷居，不足以爲士矣！」
en: The Master said, "The scholar who cherishes the love of comfort is not fit to be deemed a scholar."

source: 子曰：「邦有道，危言危行；邦無道，危行言孫。」
en: The Master said, "When good government prevails in a state, language may be lofty and bold, and actions the same. When bad government prevails, the actions may be lofty and bold, but the language may be with some reserve."

source: 子曰：「有德者必有言，有言者不必有德。仁者必有勇，勇者不必有仁。」
en: The Master said, "The virtuous will be sure to speak correctly, but those whose speech is good may not always be virtuous. Men of principle are sure to be bold, but those who are bold may not always be men of principle."

source: 南宮适問於孔子曰：「羿善射，奡盪舟，俱不得其死然。禹稷躬稼而有天下。」夫子不答。南宮适出，子曰：「君子哉若人！尙德哉若人！」
en: Nan-kung Kwo, submitting an inquiry to Confucius, said, "I was skillful at archery, and Ao could move a boat along upon the land, but neither of them died a natural death. Yu and Chi personally wrought at the toils of husbandry, and they became possessors of the kingdom." The Master made no reply; but when Nan-kung Kwo went out, he said, "A superior man indeed is this! An esteemer of virtue indeed is this!"

source: 子曰：「君子而不仁者有矣夫！未有小人而仁者也！」
en: The Master said, "Superior men, and yet not always virtuous, there have been, alas! But there never has been a mean man, and, at the same time, virtuous."

source: 子曰：「愛之，能勿勞乎？忠焉，能勿誨乎？」
en: The Master said, "Can there be love which does not lead to strictness with its object? Can there be loyalty which does not lead to the instruction of its object?"

source: 子曰：「爲命，裨諶草創之，世叔討論之，行人子羽脩飾之，東里子產潤色之。」
en: The Master said, "In preparing the governmental notifications, P'i Shan first made the rough draught; Shi-shu examined and discussed its contents; Tsze-yu, the manager of Foreign intercourse, then polished the style; and, finally, Tsze-ch'an of Tung-li gave it the proper elegance and finish."

source: 或問子產，子曰：「惠人也。」問子西。曰：「彼哉彼哉！」問管仲。曰：「人也，奪伯氏騈邑三百，飯疏食，沒齒，無怨言。」
en: Some one asked about Tsze-ch'an. The Master said, "He was a kind man." He asked about Tsze-hsi. The Master said, "That man! That man!" He asked about Kwan Chung. "For him," said the Master, "the city of Pien, with three hundred families, was taken from the chief of the Po family, who did not utter a murmuring word, though, to the end of his life, he had only coarse rice to eat."

source: 子曰：「貧而無怨，難；富而無驕，易。」
en: The Master said, "To be poor without murmuring is difficult. To be rich without being proud is easy."

source: 子曰：「孟公綽，爲趙、魏老則優，不可以爲滕、薛大夫。」
en: The Master said, "Mang Kung-ch'o is more than fit to be chief officer in the families of Chao and Wei, but he is not fit to be great officer to either of the States Tang or Hsieh."

source: 子路問成人。子曰：「若臧武仲之知，公綽之不欲，卞莊子之勇，冉求之藝，文之以禮樂，亦可以爲成人矣！」曰：「今之成人者，何必然？見利思義，見危授命，久要不忘平生之言，亦可以爲成人矣！」
en: Tsze-lu asked what constituted a complete man. The Master said, "Suppose a man with the knowledge of Tsang Wu-chung, the freedom from covetousness of Kung-ch'o, the bravery of Chwang of Pien, and the varied talents of Zan Ch'iu; add to these the accomplishments of the rules of propriety and music:—such a one might be reckoned a complete man." He then added, "But what is the necessity for a complete man of the present day to have all these things? The man, who in the view of gain, thinks of righteousness; who in the view of danger is prepared to give up his life; and who does not forget an old agreement however far back it extends:—such a man may be reckoned a complete man."

source: 子問公叔文子於公明賈，曰：「信乎？夫子不言不笑不取乎？」公明賈對曰：「以吿者過也！夫子時然後言，人不厭其言；樂然後笑，人不厭其笑；義然後取，人不厭其取。」子曰：「其然！豈其然乎？」
en: The Master asked Kung-ming Chia about Kung-shu Wan, saying, "Is it true that your master speaks not, laughs not, and takes not?" Kung-ming Chia replied, "This has arisen from the reporters going beyond the truth.—My master speaks when it is the time to speak, and so men do not get tired of his speaking. He laughs when there is occasion to be joyful, and so men do not get tired of his laughing. He takes when it is consistent with righteousness to do so, and so men do not get tired of his taking." The Master said, "So! But is it so with him?"
